use watch_shop_goriachev;

-- очистка таблиц
SET SQL_SAFE_UPDATES = 0;
delete
from sales;
delete
from sellers;
delete
from purchases;
delete
from watches;
delete
from watch_types;
delete
from manufactures;
delete
from countries;
SET SQL_SAFE_UPDATES = 1;

-- заполнение таблицы Страны
insert into countries (name)
values ('Франция'),
       ('Испания'),
       ('Италия'),
       ('Греция'),
       ('Хорватия'),
       ('Турция'),
       ('Таиланд'),
       ('Египет'),
       ('ОАЭ'),
       ('США'),
       ('Канада'),
       ('Япония'),
       ('Китай'),
       ('Австралия'),
       ('Новая Зеландия');

-- заполнение таблицы Производители
insert into manufactures (name, country_id)
values ('Time Masters', 1),
       ('Precision Timepieces', 2),
       ('Horology House', 3),
       ('The Watch Workshop', 4),
       ('Eternal Watches', 5),
       ('Seiko', 6),
       ('Swatch', 7),
       ('Tag Heuer', 8),
       ('Rolex', 9),
       ('Patek Philippe', 10),
       ('Omega', 11),
       ('Casio', 12),
       ('Timex', 13),
       ('Fossil', 14),
       ('Guess', 15);

-- заполнение таблицы Типы часов
insert into watch_types (name)
values ('Кварцевые'),
       ('Механические'),
       ('Автоматические'),
       ('Спортивные'),
       ('Классические'),
       ('Повседневные'),
       ('Швейцарские'),
       ('Японские'),
       ('Китайские'),
       ('Американские'),
       ('Европейские'),
       ('Премиум'),
       ('Лимитированные серии'),
       ('Интерьерные'),
       ('Будильники');

-- заполнение таблицы Часы
INSERT INTO watches (manufacture_id, name, watch_type_id)
VALUES (5, 'Alpha', 9),
       (1, 'Classic', 4),
       (7, 'Originals', 8),
       (3, 'Royal', 10),
       (13, 'Expedition', 11),
       (2, 'Elite', 12),
       (10, 'Nautilus', 2),
       (8, 'Aquaracer', 5),
       (4, 'Signature', 15),
       (6, '5 Sports', 13),
       (11, 'Seamaster', 1),
       (14, 'Machine', 7),
       (9, 'Submariner', 14),
       (12, 'G-Shock', 6),
       (1, 'Aviator', 9),
       (5, 'Classic', 4),
       (8, 'Carrera', 8),
       (3, 'Elite', 10),
       (13, 'Weekender', 11),
       (2, 'Master', 12),
       (10, 'Calatrava', 2),
       (7, 'Big Bold', 5),
       (4, 'Legacy', 15),
       (6, 'Prospex', 13),
       (11, 'Speedmaster', 1);


-- заполнение таблицы Закупки
insert into purchases (date, watch_id, amount, price)
values ('2022-12-03', 13, 89, 23100),
       ('2022-12-16', 4, 81, 52000),
       ('2023-01-07', 22, 95, 28900),
       ('2023-01-05', 8, 90, 77700),
       ('2022-12-25', 25, 94, 18300),
       ('2023-01-19', 1, 83, 45000),
       ('2022-12-09', 12, 80, 57600),
       ('2022-12-18', 17, 87, 63100),
       ('2023-01-10', 9, 98, 32100),
       ('2023-01-21', 20, 86, 18900),
       ('2022-12-05', 23, 80, 63500),
       ('2023-01-14', 16, 95, 22900),
       ('2023-01-23', 10, 89, 17600),
       ('2022-12-30', 6, 100, 38500),
       ('2022-12-20', 19, 92, 77800),
       ('2023-01-12', 2, 83, 62500),
       ('2023-01-30', 7, 88, 31400),
       ('2022-12-12', 14, 84, 50100),
       ('2022-12-23', 11, 87, 19400),
       ('2022-12-25', 3, 73, 45400),
       ('2022-12-27', 5, 84, 53400),
       ('2022-12-28', 18, 90, 60300),
       ('2022-12-29', 15, 70, 34000),
       ('2022-01-05', 21, 67, 65300),
       ('2023-01-28', 24, 82, 33000);

-- заполнение таблицы Продавцы
insert into sellers (surname, name, patronymic, interest)
values ('Иванов', 'Владимир', 'Александрович', 1.3),
       ('Петров', 'Валерий', 'Витальевич', 4.2),
       ('Сидоров', 'Александр', 'Сергеевич', 5.3),
       ('Козлов', 'Андрей', 'Александрович', 2.3),
       ('Смирнова', 'Елена', 'Дмитриевна', 1.1),
       ('Федорова', 'Ольга', 'Андреевна', 0.3),
       ('Попов', 'Михаил', 'Сергеевич', 5.3),
       ('Александрова', 'Надежда', 'Павловна', 7),
       ('Кузнецова', 'Екатерина', 'Ивановна', 2.3),
       ('Николаева', 'Татьяна', 'Алексеевна', 5.3),
       ('Михайлов', 'Владимир', 'Геннадьевич', 0.5),
       ('Гаврилов', 'Анатолий', 'Сергеевич', 10.3),
       ('Полякова', 'Ирина', 'Владимировна', 7.2),
       ('Калинина', 'Оксана', 'Сергеевна', 3.3),
       ('Антонов', 'Дмитрий', 'Андреевич', 6.5),
       ('Лебедева', 'Марина', 'Ивановна', 5.3),
       ('Савельев', 'Виктор', 'Александрович', 8.2),
       ('Борисов', 'Георгий', 'Петрович', 3.4),
       ('Королева', 'Анастасия', 'Сергеевна', 7.5),
       ('Тихонов', 'Василий', 'Дмитриевич', 4.4);

-- заполнение таблицы Продажи
insert into sales (date, watch_id, seller_id, amount, price)
values ('2023-02-09', 20, 9, 3, 21850),
       ('2023-02-22', 23, 16, 2, 18700),
       ('2023-02-12', 13, 15, 6, 41300),
       ('2023-02-17', 1, 5, 4, 21500),
       ('2023-02-15', 8, 7, 5, 60800),
       ('2023-02-18', 2, 13, 4, 62250),
       ('2023-02-06', 3, 1, 2, 35700),
       ('2023-02-11', 25, 18, 3, 62650),
       ('2023-02-23', 7, 2, 2, 33500),
       ('2023-02-08', 16, 7, 5, 31550),
       ('2023-02-07', 22, 19, 4, 16600),
       ('2023-02-01', 5, 12, 3, 22500),
       ('2023-02-12', 17, 7, 5, 25850),
       ('2023-02-28', 11, 2, 3, 31250),
       ('2023-02-26', 12, 20, 5, 62500),
       ('2023-02-19', 9, 17, 1, 76800),
       ('2023-02-08', 6, 6, 2, 19000),
       ('2023-02-10', 4, 11, 4, 40500),
       ('2023-02-14', 15, 3, 3, 53300),
       ('2023-02-22', 8, 2, 6, 19500),
       ('2023-02-03', 14, 15, 2, 56750),
       ('2023-02-21', 23, 17, 5, 31650),
       ('2023-02-05', 21, 5, 1, 35500),
       ('2023-02-14', 24, 11, 6, 71500),
       ('2023-02-02', 16, 16, 1, 17300),
       ('2023-02-25', 3, 3, 3, 18450),
       ('2023-02-18', 10, 14, 5, 54750),
       ('2023-02-24', 2, 20, 4, 33000),
       ('2023-02-19', 19, 4, 6, 56700),
       ('2023-02-27', 18, 13, 3, 27350),
       ('2023-02-16', 12, 9, 1, 24450),
       ('2023-02-04', 13, 7, 6, 70750),
       ('2023-03-05', 1, 14, 4, 23000),
       ('2023-03-08', 21, 4, 5, 26400),
       ('2023-03-16', 8, 9, 1, 26950),
       ('2023-02-05', 13, 5, 2, 65000),
       ('2023-03-04', 1, 11, 5, 20000),
       ('2023-02-22', 21, 13, 6, 35000),
       ('2023-03-14', 9, 14, 4, 50000),
       ('2023-03-02', 19, 3, 3, 55000),
       ('2023-03-20', 17, 18, 2, 75000),
       ('2023-02-13', 6, 1, 1, 45000),
       ('2023-02-17', 22, 8, 3, 20000),
       ('2023-02-27', 4, 17, 4, 30000),
       ('2023-03-18', 5, 2, 5, 70000),
       ('2023-03-08', 14, 19, 1, 60000),
       ('2023-03-09', 16, 10, 2, 35000),
       ('2023-02-19', 24, 15, 6, 40000),
       ('2023-02-23', 11, 12, 1, 65000),
       ('2023-03-22', 8, 6, 3, 45000),
       ('2023-03-21', 12, 4, 4, 50000),
       ('2023-03-01', 2, 16, 2, 25000),
       ('2023-02-25', 23, 9, 1, 55000),
       ('2023-02-08', 15, 20, 5, 80000),
       ('2023-02-11', 20, 7, 4, 30000);
